---
title: Path3d
classe: Autodesk.Revit.DB.Path3d
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.SketchBase
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# Path3d

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `CurveArrArray AllCurveLoops { get; }` | `path3d.AllCurveLoops` | CurveArrArray |
| `CurveArray CurveLoop { get; }` | `path3d.CurveLoop` | CurveArray |
| `Int32 NumCurveLoops { get; }` | `path3d.NumCurveLoops` | Int32 |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```